---------------------------------------------------------------
-- ワールドマップ、エリアマップの設定ファイル
---------------------------------------------------------------

-- カメラ
camera = {
	pos = { 0.0, 0.0, 10.865 },
	tgt = { 0.0, 16.105, 0.478 },
	fovy = 45.0,
}

-- ライト
light = {
	ambient_col =  { 55, 80, 145 },
	diffuse_dir = { 0.0, 1.0, 0.0 },
	diffuse_col =  { 220, 220, 220 },
	gloss = 16.0,
	sky_col =  { 80, 80, 80, },
	ground_col ={ 5, 10, 50, },
}

-- グレア
glare = {
	ev = 1.08,
	brightpass = 2.0,
}

-- フォグ
fog = {
	type = "linear",
	start_z = 20.0,
	end_z = 100.0,
	color = { 20, 120, 205 },
}
