---------------------------------------------------------------
-- ワールドマップ、エリアマップの設定ファイル
---------------------------------------------------------------

-- カメラ
camera = {
	pos = { 0.0, 0.0, 10.865 },
	tgt = { 0.0, 16.105, 0.478 },
	fovy = 45.0,
}

-- ライト
light = {
	ambient_col = { 200, 180, 150 },
	diffuse_dir = { 5.0, 40.0, -50.0 },
	diffuse_col = { 220, 214, 211 },
	gloss = 32.0,
	sky_col = { 58, 48, 30 },
	ground_col = { 52, 9, 60 },
}

-- グレア
glare = {
	ev = 1.03,
	brightpass = 2.98,
}

-- フォグ
fog = {
	type = "linear",
	start_z = 10.0,
	end_z = 60.0,
	col = { 200, 150, 150 },
}
