---------------------------------------------------------------
-- ワールドマップ、エリアマップの設定ファイル
---------------------------------------------------------------

-- カメラ
camera = {
	pos = { 0.0, 0.0, 10.865 },
	tgt = { 0.0, 16.105, 0.478 },
	fovy = 45.0,
}

-- ライト
light = {
	ambient_col = { 170, 170, 170 },
	diffuse_dir = { 5.0, 40.0, -50.0 },
	diffuse_col = { 170, 180, 180 },
	gloss = 16.0,
	sky_col = { 30, 40, 50 },
	ground_col = { 50, 60, 50 },
}

-- グレア
glare = {
	ev = 1.10,
	brightpass = 2.00,
}

-- フォグ
fog = {
	type = "linear",
	start_z = 30.0,
	end_z = 60.0,
	col = { 10, 70, 140 },
}
