---------------------------------------------------------------
-- ワールドマップ、エリアマップの設定ファイル
---------------------------------------------------------------

-- カメラ
camera = {
	pos = { 0.0, 0.0, 10.865 },
	tgt = { 0.0, 16.105, 0.478 },
	fovy = 45.0,
}

-- ライト
light = {
	ambient_col = { 200, 180, 150 },
	diffuse_dir = { 5.0, 40.0, -50.0 },
	diffuse_col = { 185, 193, 200 },
	gloss = 32.0,
	sky_col = { 40, 55, 60 },
	ground_col = { 35, 37, 42 },
}

-- グレア
glare = {
	ev = 1.08,
	brightpass = 2.98,
}

-- フォグ
fog = {
	type = "linear",
	start_z = 10,
	end_z =85.0,
	col = { 10, 15, 85 },
}
