---------------------------------------------------------------
-- ワールドマップ、エリアマップの設定ファイル
---------------------------------------------------------------

-- カメラ
camera = {
	pos = { 5.423, -76.325, -23.147 },
	tgt = { 0.0, 0.0, 8.921 },
	fovy = 47.2,
}

-- ライト
light = {
	ambient_col = { 255, 255, 255 },
	diffuse_dir = { 18.0, 15.0, 20.0 },
	diffuse_col = { 120, 180, 230 },
	gloss = 100.0,
	sky_col = { 255, 0, 0 },
	ground_col = { 0, 0, 0 },
}

-- グレア
glare = {
	ev = 1.03,
	brightpass = 2.97,
}

-- フォグ
fog = {
	type = "linear",
	start_z = 90.0,
	end_z = 120.0,
	col = {50, 60, 70 },
}
