---------------------------------------------------------------
-- ワールドマップ、エリアマップの設定ファイル
---------------------------------------------------------------

-- カメラ
camera = {
	pos = { 0.0, 0.0, 10.865 },
	tgt = { 0.0, 16.105, 0.478 },
	fovy = 45.0,
}

-- ライト
light = {
	ambient_col = { 200, 180, 150 },
	diffuse_dir = { 5.0, 40.0, -50.0 },
	diffuse_col = { 170, 180, 180 },
	gloss = 16.0,
	sky_col = { 60, 70, 80, },
	ground_col = { 40, 30, 40, },
}

-- グレア
glare = {
	ev = 1.05,
	brightpass = 2.00,
}

-- フォグ
fog = {
	type = "linear",
	start_z = 30.0,
	end_z =50.0,
	col = { 70, 130, 200 },
}
